{"_id":"~4059762768","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670261995451,"_updatedAt":1670262519256,"name":"IRM-5-MaliciousNetworkBehaviour","displayName":"Malicious Network Behaviour (CERT-SG IRM5)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~2999582760","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670262519256,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n**Report**\nA report should be written and made available to all the actors.\nThe following themes should be described:\n▪ Initial cause of the issue\n▪ Actions and timelines\n▪ What went right\n▪ What went wrong\n▪ Incident cost\n▪ Indicators of compromise\n\n---\n**Capitalize**\nActions to improve the network intrusion management processes should be defined to capitalize on this\nexperience.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~3076419728","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670262519251,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n**Intrusion Detection Systems (EDR, NIPS, IPS)**\n▪ Ensure that the monitoring tools are up-to-date.\n▪ Establish contacts with your network and security operation teams.\n▪ Make sure that an alert notification process is defined and well-known from everyone.\n▪ Verify access to the device and its ability to watch concerned perimeters.\n▪ Ensure that you can isolate endpoints, area (with EDR for example or Firewall).\n\n---\n**Network**\n▪ Make sure that an inventory of the network access points is available, accessible and up-to-date, if\npossible, with versioning.\n▪ Make sure that network teams have up to date network maps and configurations with concerned\nzones and operational teams.\n▪ Look for potential unwanted network access points regularly and close them.\n▪ Look for VPN access and Cloud access from rare locations.\n▪ Deploy and monitor traffic management tools.\n\n---\n**Baseline traffic**\n▪ Identify the baseline traffic and flows.\n▪ Identify the business-critical flows.\n\n> Make sure people are comfortable with the tools and know how to use them.\n> Keep logs operationaleven when they have been archived.\n> **Having a good log retention policy is essential (more than 6 months).**","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~3163177120","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670262519255,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO STOP THE MALICIOUS BEHAVIOR.\n\n**Block the source**\n▪ Using analysis from previous steps identification and containment, find out all communication channels used by attacker and block them on all your network boundaries.\n▪ If the source has been identified as an insider, take appropriate action and involve your management and/or HR team and/or legal team.\n▪ If the source has been identified as an external offender, consider involving abuse teams and law enforcement services if required.\n\n---\n**Technicalremediation**\n▪ Define a remediation process. If necessary, this process can be validated by another structure, like your incident response team for example.\n▪ Remediation steps from the Intrusion IRMs (2-Windows and 3-Linux) can also be useful.\n\n---\n**Test and enforce**\n▪ Test the remediation process and make sure that it properly works without damaging any service.\n▪ Enforce the remediation process once tests have been approved by both IT and business.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3163181216","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670262519255,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\n1. Ensure that the network traffic is back to normal.\n2. Re-allow connections to previously contained network segments.\n\n> All these steps shall be made in a step-by-step manner and with a technical monitoring.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~4059766864","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670262519252,"title":"Identification","group":"default","description":"**OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.**\n\n**Sources of detection:**\n▪ Notification by user/helpdesk.\n▪ IDS/IPS/NIDS/EDR logs, alerts and reports.\n▪ Detection by network staff.\n▪ Firewall and proxy logs.\n▪ Complaint from an external source.\n▪ Honeypots or any other deceptive solution.\n\n---\n**Record suspect network activity**\nNetwork frames can be stored into a file and transmitted to your incident response team for further analysis.\nUse network capture tools (tshark, windump, tcpdump…) to dump malicious traffic. Use a hub or port mirroring on an affected LAN to collect valuable data.\nNetwork forensic requires skills and knowledge. Ask your incident response team for assistance or advice.\nKnow how to restore and consult logs even when they have been archived.\n\n---\n**Analyze the attack**\n▪ Analyze alerts generated by your IDS.\n▪ Review statistics and logs of network devices.\n▪ Try to understand the goal of the malicious traffic and identify the infrastructure components affected by it.\n▪ Map with business risks to properly prioritize the analysis or containment.\n▪ Identify traffic’s technical characteristics:\n  o Source IP address(es)\n  o Ports used, TTL, Packet ID, …\n  o Protocols used\n  o Targeted machines/services\n  o Exploit(s)\n  o Remote accounts logged in","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~4059770960","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670262519254,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n\n> If the issue is considered as strategic (sensitive resource access), a specific crisis management cell should be activated.\n\n**Depending on the criticality of the impacted resources, the following steps can be performed and monitored:**\n\n▪ Disconnect the compromised area from the network.\n▪ Isolate the source of the attack. Disconnect the affected computer(s) in order to perform further investigation.\n▪ Adopt acceptable mitigation controls (MFA, geo-filtering) for the business-critical flux in agreement with the business line managers.\n▪ Terminate unwanted connections or processes on affected machines.\n▪ Use firewall/IPS/EDR rules to block the attack.\n▪ Use IDS rules to match with this malicious behavior and inform technical staff on new events.\n▪ Apply ad hoc actions in case of strategic issue:\n  o Deny egress destinations in EDR, proxies and/or firewalls.\n  o Configure security controls policy management to contain or reject connections from compromised machines.\n  o Limit access to critical/confidential data.\n  o Create booby-trapped documents with watermarking that could be used as a proof of theft.\n  o Notify targeted business users about what must be done and what is forbidden.\n  o Configure logging capabilities in verbose mode on targeted environment and store them in a remote secure server.","status":"Waiting","flag":false,"order":2,"extraData":{}}]}