{"_id":"~4464681016","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670341994982,"_updatedAt":1670342908762,"name":"IRM-10-SocialEngineering","displayName":"Social Engineering (CERT-SG IRM10)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~3194912768","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670342908754,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n▪ Phone call / someone you don't know calls you/your service, asking for detailed information.\n  o If the contact works out of the company and requests for information that could be valuable for a competitor, deny his requests and go to part 3.\n  o If the contact pretends to be an employee of your company but the phone number is hidden or not internal, propose that you call back to the declared number in the directory. If the supposedly attacker agrees, call back to check. If he rejects this option, go to part 3.\n\n> The attacker might use several techniques to entice his victim to speak (fear, curiosity, empathy ...). Do not disclose information in any case.\n> Listen carefully to his requests and at the end ask for a phone number to call back or an email address to reply.\n> Take notes and stay calm, even if the attacker is shouting or threatening, remember he tries to use human weaknesses.\n\nIf you can go further, the following information will be precious:\n▪ the name of the correspondent\n▪ requested information / people\n▪ accent, language skills\n▪ industry language and organizational knowledge\n▪ background noises\n▪ time and duration of the call\n▪ E-mail / Someone you don't know requests detailed information:\n  o If the contact has an “out of the company” e-mail address and requests information that could be valuable for a competitor, go to part 3.\n  o If the contact uses an internal e-mail address but is asking for weird information, ask him some explanations and use the company directory to get his manager's name that you'll place as a copy.\n▪ Eventually notify top management to inform them that an incident has been encountered relating to a social engineering attack. They might understand the goals depending on the context.","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~3194916864","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670342908756,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n\nAt this step, you should be pretty sure that you're dealing with a social engineering attack.\n\n**Actions for all employees:**\n\n▪ Phone call:\n**If the attacker urges you to give a phone number, follow these steps:**\n  o Use the “red phone line” from your CERT/CSIRT, if existing.\n  o Give him the number with an invented name.\n  o Immediately call your CERT/CSIRT team explaining what happened and the chosen invented name.\n  o If the attacker stresses you too much and does not let you time to find the Red Phone number, ask him to call you back later, pretending a meeting.\n**If the attacker wants to reach someone, follow these points :**\n  o Place on hold the attacker and call CERT/CSIRT team and explain what happened.\n  o Transfer the conversation of the attacker to CERT/CSIRT team (do not give him the number).\n\n▪ E-mail\nForward to your security team all email including headers (send as attached documents) for investigation purposes. It might help to track the attacker.\n\n---\n**Actions for CERT or incidentresponse team:**\n▪ Phone call\nResume the conversation with the attacker and use one of these techniques:\n  o Impersonate the identity of the people whom the attacker is willing to speak\n  o Slow down and make last the conversation and entice the attacker to make mistake\n  o Explain him that social engineering attack is forbidden by law, punished by sanctions and that lawyer team will handle the issue if it continues\n\n*If the trap phone number has been used, prepare to “burn it”, create another one and display it in the directory.*\n\n▪ E-mail\no Collect as much information as possible on the email address\no Analyze the email headers and try to locate the source\no Search the e-mail address with Internet tools\no Geolocalize the user behind the email address\n\n> Aggregate all social engineering attacks to visualize the scheme.","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~3686457512","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670342908750,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, AND GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n▪ Raise user awareness and security policies.\n\n> Never give any personal or corporate information to an unidentified person. This could include user IDs, passwords, account information, name, e-mail address, phone (mobile or landline) numbers, address, social security number, job\n> titles, information on clients, organization orIT systems. \n> The goal of the social engineer is to steal human resources, corporate secrets or customer/user data.\n\n**Report any suspicious event to your manager, who will forward it to the CISO in orderto have a centralized reporting.**\n\n▪ Have a defined process to redirect any “weird” request to a “red” phone, if needed.\n▪ Prepare to handle conversation with social engineers to identify which information could help tracking the attacker and his goals.\n▪ Check your legal department to see which actions are allowed and which reactions they can handle.\n\n---\n**RED PHONE:**\nRed phone number must be clearly tagged as “Social Engineering”.\nThe phone number must be easy to identify in the global phone directory of your company but requests on reverse number should not be displayed.\nRed phone line should always be recorded for evidence collecting purposes.","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~3686461608","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670342908759,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\nNotify the top management of the actions and the decisions taken on the social engineering case.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3768365080","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670342908760,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\nInform your hierarchy and subsidiaries about the incident, this could help to avoid similar attacks later.\n\n---\n**Report**\nAn incident report should be written and made available to all the actors of the incident.\nThe following themes should be described:\n▪ Initial cause of the infection\n▪ Actions and timelines of every important event\n▪ What went right\n▪ What went wrong\n▪ Incident cost (direct and indirect losses)\n▪ Indicators of compromise\n\n---\n**Capitalize**\nActions to improve the social engineering handling processes should be defined to capitalize on this experience, especially awareness.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~4341788824","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670342908757,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO REMOVE THE THREAT AND AVOID FUTURE INCIDENTS.\n\n**Some possible remediation actions can be tried:**\n▪ Alert the law enforcement and/or file a complaint\n▪ Discuss the problem in circles of trust to know if the company is facing this issue alone\n▪ Threaten the attacker with legal actions if he can be identified\n▪ Report email addresses used by the attacker to the provider abuse teams","status":"Waiting","flag":false,"order":3,"extraData":{}}]}