{"_id":"~3522592880","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670002543116,"_updatedAt":1670520910992,"name":"IRM-2-WindowsIntrusionDetection","displayName":"Windows Intrusion Detection (CERT-SG IRM2)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~3440799752","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520910986,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n\n### 1 – Evidence acquisition\n\n---\n\n**WARNING (VOLATILE DATA):**\n**BEFORE CARRYING OUT ANY OTHER ACTIONS, MAKE SURE TO MAKE A VOLATILE MEMORY CAPTURE BY DOWNLOADING AND RUNNING FTK IMAGER, WINPMEM OR ANOTHER UTILITY FROM AN EXTERNAL DRIVE. VOLATILE DATA PROVIDES VALUABLE FORENSIC INFORMATION AND IS STRAIGHTFORWARD TO ACQUIRE.**\n---\n\n**Volatile data**\nVolatile data is useful to perform analysis on command line history, network connections, etc. Use “Volatility” if possible.\n\n**Take a triage image**\nUse tools like EDR, FastIR, DFIR Orc, KAPE with preconfigured profiles.\n\n**Or full disk copy image**\nWith tools like dd, FTKImager, etc.\n\n> Warning: you may need admin privileges on the machine or a write-blocker (physical or logical) depending on the usecase.\n\n### 2 – Memory analysis:\n▪ Look for rogue processes\n▪ Review process DLLs and handles\n▪ Check network artifacts\n▪ Look for code injection\n▪ Check the presence of rootkits\n▪ Dump suspicious processes for further analysis\n\n> If the issue is considered as strategic (sensitive resources access), a specific crisis management cell should be activated. i.e. Large Scale Compromise IRM\n\n### 3 – Identify persistence mechanisms:\n\nPersistence can be allowed through different techniques including:\n▪ Scheduled tasks\n▪ Service replacement\n▪ Service creation\n▪ Auto-start registry keys and startup folder\n▪ Dll search order hijacking\n▪ Trojaned legitimate system libraries\n▪ Local Group Policy\n▪ MS office add-in\n▪ Pre-boot persistence (BIOS/UEFI/MBR alteration)\n\n*you may consider using Microsoft autoruns for a quick win\n\n### 4 – Check Event Logs\n\n▪ Scheduled tasks log (creation and execution)\n▪ Account Logon Events (check for out-of-office connections)\n▪ Suspicious local account\n▪ Malicious Services\n▪ Clearing Event Logs\n▪ RDP/TSE Logs\n▪ Powershell Logs\n▪ SMB Logs\n\n### 5 – Super-Timeline\n\n▪ Process evidence and generate a super-timeline with tools like Log2timeline\n▪ Analyze the generated timeline with TimelineExplorer or glogg for example\n\n### 6 – To go further\n\n▪ Hash lookups\n▪ MFT anomalies and timestamping\n▪ Anti-virus/Yara analysis/Sigma:\nMount the evidence in a read-only mode. Run Anti-virus scan or multiple Yara files for a quick-win detection. Please note that unknown malware may be not detected.\n\n> If the issue is considered as strategic (sensitive resources access), a specific crisis management cell should be activated. i.e. Large Scale Compromise IRM","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~3440803848","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520910990,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\nNo matter how far the hacker has advanced into the system and the knowledge you might have obtain about the compromise, as long as the system has been breached, the best practice is **to reinstall the system fully from original media and apply all security updates to the newly installed system.**\n\n---\n\nIn case this solution can’t be applied, you should:\n\n▪ **Change all the system’s accounts passwords** and make your users do so in a secure way.\n▪ **Restore all files** that could have been altered (Example: svchost.exe) by the attacker.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3481751672","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520910989,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO REMOVE THE THREAT AND AVOID FUTURE INCIDENTS.\n\n> **WARNING:**\n> **ONLY START REMEDIATING ONCE YOU ARE 100% SURE THAT YOU HAVE WELL SCOPED UP AND CONTAINED THE PERIMETER - TO PREVENT THE ATTACKER FROM LAUNCHING RETALIATION ACTIONS.**\n\n---\n**In case the system has been compromised:**\n\n▪ The most straight-forward way to get rid of the malware is to remaster the machine.\n▪ Temporarily remove all accesses to the accounts involved in the incident.\n▪ Remove all malicious files installed and persistence mechanisms put in place by the attacker.\n▪ Apply the EDR prevention mode for all identified IOCs.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3809468440","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520910991,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n\n**Report**\nAn incident report should be written and made available to all applicable actors.\n\nThe following topics should be covered:\n▪ Initial detection\n▪ Actions and timelines of every important events\n▪ What went right\n▪ What went wrong\n▪ Impact from the incident\n▪ Indicators of compromise\n\n---\n**Lessons learned**\n\nActions to improve the Windows intrusion detection management processes should be defined to capitalize on this experience.\nProfiles of acquisition tools can be tweaked to better match artifacts detected during the investigation.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~3932295384","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520910984,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n**Endpoints**\n• Ensure that the monitoring tools are up to date;\n• Establish contacts with your network and security operation teams;\n• Make sure that an alert notification process is defined and well-known from everyone\n• Make sure all equipment get setting on same NTP;\n• Select what kind of files can be lost / stolen and restrict the access for confidential files;\n• Make sure that analysis tools are up, functional (Antivirus, EDR, IDS, logs analyzers), not compromised, and up to date;\n• Install from the same original master.\n\n---\n**Servers**\n▪ Deploy an EDR solution on endpoints and servers\n  - This tool became one of the cornerstones of the incident response in case of ransomware or in large scale compromise, facilitating identification, containment, and remediation phases.\n  - Launch EDR Search and AV scan with IOC explicit rules and get first indicators for remediation progress following.\n  - Set your EDR policies in prevent mode.\n\n▪ In absence of EDR, a physical access to the suspicious system should be given to the forensic investigator. Physical access is preferred to remote access, since the hacker could detect the investigations done on the system (by using a network sniffer for example).\n▪ A physical copy of the hard-disk might be necessary for forensic and evidence purposes. Finally, if needed, a physical access could be needed to disconnect the suspected machine from any network.\n▪ Acquisition profiles for EDR or tools like FastIR, DFIR Orc, KAPE must be prepared.\n▪ A good knowledge of the usual network activity of the machine/server is needed. You should have a file on a secure place describing the usual port activity, to compare efficiently to the current state.\n▪ A good knowledge of the usual services running on the machine can be very helpful. Don’t hesitate to ask a Windows Expert for his assistance, when applicable. A good idea is also to have a map of all services/running process of the machine.\n\n---\n**Be prepared to notify abuse teams and law enforcement services and regulators if required during an incident (cell crisis management).**\n\n\n\nIt can be a real advantage to work in a huge corporate environment, where all user machines are the same, installed from a master. Have a map of all processes/services/applications. On such environment where users are not allowed to install software, consider any additional process/service/application as suspicious.\n\n\n\n**The more you know the machine in its clean state, the more chances you have to detect any fraudulent activity running from it.**","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~3932299480","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520910987,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n\n> Make sure that all footholds of the attackers have been identified before taking containment measure \n> Be discrete if necessary and possible\n\n**Memory and selective volatile artifacts’ acquisition must be achieved before the following steps:**\n\nIf the machine is considered critical for your company’s business activity and can’t be disconnected, backup all important data in case the hacker notices you’re investigating and starts deleting files.\nIf possible, isolate the machine via EDR\n\n**Or**\n\nIf the machine is not considered critical for your company and can be disconnected, shut the machine down the hard way, removing its power plug. If it is a laptop with a battery on, just push the “off” button for some seconds until the computer switches off.\n\n---\n**Offline investigations should be started right away if the live analysis didn’t give any result, but the system should still be considered compromised:**\n\n▪ Inspect network shares or any publicly accessible folders shared with other users to see if the malware has spread through it.\n▪ More generally, try to find how the attacker got into the system. All leads should be considered. If no computer proof of the intrusion is found, never forget it could come from a physical access or a complicity/stealing of information from an employee.\n▪ Apply fixes when applicable (operating system and applications), in case the attacker used a known vulnerability.","status":"Waiting","flag":false,"order":2,"extraData":{}}]}