{"_id":"~4505641016","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670432301417,"_updatedAt":1670432876675,"name":"IRM-15-TrademarkInfringement","displayName":"Trademark Insigement (CERT-SG IRM15)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~2498617576","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670432876667,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO STOP THE TRADEMARK INFRINGEMENT.\n\n**In most trademark issues, monitoring is usually sufficient. Remediation must be started only if there’s an impact on your company or its subsidiaries.**\n\n---\n**Domain name**\n▪ Contact the domain name owner and hosting service provider to notify them of the trademark infringement and ask them to remove the fraudulent content.\n▪ Contact the domain name registrar to notify them of the trademark infringement and ask them to deactivate the associated domain name or to transfer it to you.\n▪ Ask the domain name owner or registrar to redirect all DNS requests to your name servers if possible.\n▪ If neither the domain name owner nor the registrar complies with your requests, initiate a Uniform Domain-Name Dispute-Resolution Policy (UDRP) procedure if you are empowered to do so or ask the internal contacts to conduct it.\n\n---\n**Social network account**\n▪ Contact the service provider of the infringing page, group or account to notify them of any violation of their Trademark Policies or Terms of Service and ask them to deactivate the infringing account.\n▪ Ask the service provider to transfer the trademarked account to an existing company account if possible.\n\n---\n**In both cases, send e-mails to the contact addresses of the registrar or service provider. There’s generally an e-mail address to report abuse, legal or copyrightissues.**\n\n> Fill out a trademark or abuse complain form if available.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3113001104","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670432876671,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\n**Assess the end of the infringement case**\n▪ Ensure that the infringing domain name, page, group or account are down or redirected to your company.\n▪ Keep monitoring the infringing domain name, page, group or account. Sometimes a website can reappear later.\n▪ Consider acquiring the infringing domain name if available.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3113005200","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670432876673,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n**Report**\nA crisis report should be written and made available to all of the actors of the crisis management cell.\n\nThe following themes should be described:\n▪ Initial cause of the infection\n▪ Actions and timelines of every important event\n▪ What went right\n▪ What went wrong\n▪ Incident cost\n▪ Indicators of compromise\n\n---\n**Capitalize**\n▪ Consider what preparation steps you could have taken to respond to the incident faster or more efficiently.\n▪ Update your contacts-lists and add notes as to what is the most effective way to contact each involved party.\n▪ Consider what relationships inside and outside your organization could help you with future incidents.\n▪ Collaborate with legal teams if a legal action is required.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~3891237080","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670432876663,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE INFRINGEMENT EFFECTS ON THE TARGETED ENVIRONMENT.\n\n**Evaluate the impact of the trademark infringement:**\n▪ Can it be used for traffic redirection (cybersquatting, typosquatting, SEO)?\n▪ Can it be used for spoofing, counterfeiting or scamming (cybersquatting with redirect to the corporate website)?\n▪ Can it be used to slander the brand?\n▪ Evaluate the visibility of the infringing component:\n  o Website visibility (ranking).\n  o Number of fans or followers on social medias.\n▪ Monitor the dormant, infringing domain for signs of fraudulent activities.\n\n*Refer to IRM-13-Phishing and IRM-14-Scamfor more information.*","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~4751405144","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670432876654,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n▪ Maintain a list of all legitimate trademarks belonging to your company and its subsidiaries. This will help in assessing the situation at hand and prevent you from starting an infringement procedure on an outdated trademark, an unrelated legitimate website or social network account.\n▪ Establish a thorough, evidence-based information list related to your trademarks to support your legal rights:\n  o Name(s), legitimate domain names and social media accounts used by your company and its subsidiaries\n  o Your trademarked words, symbols, taglines, graphics, etc.\n  o Trademark registration numbers if applicable\n  o International and federal/local trademark registration offices (USPTO, INPI, etc.) where registered trademarks have been labelled as such if applicable\n  o Any other document establishing clearly that a trademark belongs to your company\n▪ Prepare trademark infringement e-mail forms. You will use them for every trademark infringement case, if possible in several languages. This will help speed up things when trying to reach out the registrar, service provider and any other relevant party during the procedure.\n▪ Promote a central domain management system using normalized WHOIS fields.\n▪ Promote an ethical online advertisement to avoid appearing in parked domain names.\n▪ Prepare takedown processes and templates with the legal team.\n▪ Have process, experts, and technologies in place to manage the brand portfolio.\n▪ Have a centralize process or repository to manage applicable brand names, IPs, domains, PII’s, keywords, etc.\n\n---\n**Internal contacts**\n▪ Maintain a list of all people involved in trademark registration in the company especially those part of the legal and PR departments.\n▪ Maintain a list of all people accredited to take decisions on trademarks and eventual actions regarding trademark infringement. If possible, obtain a written agreement that gives you the ability to take this kind of decisions.\n\n---\n**External contacts**\n▪ Establish and maintain a list of external contacts within registrars and service providers involved in trademark issues.","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~4751409240","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670432876658,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n**Trademark infringement Detection**\n▪ Deploy active monitoring of domain names registration through registries’ zones updates whenever possible or brand alert services.\n▪ Set up feeds to monitor usernames, pages and groups on social networks.\n▪ Analyze HTTP referrers in website logs to identify fraudulent content downloads and fraudulent mirroring of your websites.\n▪ Set up brand name monitoring with specialized search engines.\n▪ Leverage automation whenever possible to trigger alarms and improve reaction times.\n▪ Collect and analyze alerts from trusted partners.\n\n---\n**Involve appropriate parties**\n▪ As soon as an infringement is detected, contact the people in your company who are accredited to take a decision if you haven’t been empowered to do so on your own. \n\n> The decision to act on the fraudulent domain name, group or user account must be taken as soon as possible.\n\n---\n**Collect evidence**\n▪ Collect evidence of infringing domain names, websites, specific URLs (e.g., Facebook vanity URL), pages, groups or account details.\n▪ Make a time-stamped copy of the infringing material (page, group, blog, forum, micro-blogging timeline, etc.) and take screenshots if possible.","status":"Waiting","flag":false,"order":1,"extraData":{}}]}