{"_id":"~3194904576","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670340392175,"_updatedAt":1670340982359,"name":"IRM-8-Blackmail","displayName":"Blackmail (CERT-SG IRM8)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":1,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~3686432936","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670340982347,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n▪ Alert relevant people.\n▪ Keep traces of any communications related to the incident (don’t send emails to trash; write down any phone contact with phone number and timestamp if available, fax, etc.) Try to get as much details as you can about the author (name, fax, postal address, etc.).\n▪ Examine possible courses of actions with your incident response team and legal team.\n▪ Investigate email to get all the information about the incident (username, MX servers, etc.).\n▪ If internal data is concerned, check you have a safe backup of it and try to find out how it was gathered.\n▪ Include top management to inform them that blackmail is happening and is being handled according\nto a defined process.","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~3686437032","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670340982356,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\nNotify the top management of the actions and the decision taken on the blackmail issue.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3686441128","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670340982357,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n\nIf you don’t want to file a complaint, at least notify Law Enforcement as other organizations could be affected. At the same time, inform hierarchy and subsidiaries to have a unique position in case the fraudster tries to blackmail another internal department.\n\n---\n**Report**\nAn incident report should be written and made available to all of the actors of the incident.\n\nFollowing themes should be described:\n▪ Initial detection\n▪ Actions and timelines\n▪ What went right\n▪ What went wrong\n▪ Incident cost\n▪ Indicators of compromise\n\n---\n**Capitalize**\nActions to improve the blackmail handling processes should be defined to capitalize on this experience.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~3768356888","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670340982351,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO REMOVE THE THREAT AND AVOID FUTURE INCIDENTS.\n\nIf a flaw has been identified on a technical asset or a process allowing the attacker to get access to the object of the blackmail, ask for IMMEDIATE fix in order to prevent another case.\n\n▪ After getting as much information as possible, ignore the blackmail and ensure appropriate watch is in place to detect and react accordingly on any new follow-ups.\n▪ Don’t take any remediation decision alone if strategic assets or human people are targeted. Involve appropriate departments.\n\n> Rememberthat a positive answer to the fraudster is an open doorforfurther blackmails.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~4464664632","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670340982344,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n**Contacts**\n▪ Identify internal contacts (security team, incident response team, legal department etc.).\n▪ Identify external contacts who might be needed, mainly for investigation purposes like Law Enforcement.\n▪ Make sure that security incident escalation process is defined, and the actors are clearly defined.\n▪ Be sure to have intelligence gathering capabilities (communities, contact, etc.) that might be involved in such incidents.\n\n---\n**Awareness**\n▪ Make sure that all the relevant employees are aware of blackmail issues. This can be part of the security awareness program.\n\n> Verify backup and incidentresponse process is in place and up to date.","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~4464668728","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670340982349,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n\nDetermine how you can answer to the blackmail and the consequences and costs of ignoring, answering yes or no.\n\n**Most common threats tied with blackmail are:**\n▪ Denial of service\n▪ Reveal sensitive data on Internet (credit card or other personal data from customers or internal worker/director, confidential company data, etc.)\n▪ Reveal sensitive private information about employees/VIPs\n▪ Block your data access (wiped or encrypted through ransomware for example [1])\n▪ Mass-mailing using the brand (spam, sextortion, child pornography [2], bad rumors, etc.) \n\n---\n**Check the background**\n▪ Check if similar blackmailing attempts have taken place in the past. Check if other companies have been threatened as well\n▪ All related technical data should be checked carefully and collected for investigation purposes\n▪ Search if anyone would have any interest into threatening your company:\n  o Competitors\n  o Ideologically-motivated groups\n  o Former or current employees\n▪ Try to identify the attacker with the available pieces of information\n▪ More generally, try to find how the attacker got into the system or got the object of the blackmail\n\n---\n**Contactlocal law enforcementto inform them.**\nTry to gain time and details from fraudster. Ask:\n▪ Proof of what he said: example data, intrusion proof, etc.\n▪ Time to get what fraudster wants (money, etc.)","status":"Waiting","flag":false,"order":2,"extraData":{}}]}