{"_id":"~2539524096","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1652082582852,"_updatedAt":1652175950638,"name":"Scam","displayName":"Scam (CERT-SG IRM14)","titlePrefix":"","description":"Scam case","severity":2,"tags":["veris:action:social:variety=\"Scam\"","veris:action:social:variety=\"Extortion\""],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~1966092520","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082945534,"title":"Lessons learned","group":"Aftermath","description":"- Consider what preparation steps you could have taken to respond to the incident faster or more efficiently.\n- Update your contacts-lists and add notes as to what is the most effective way to contact each involved party.\n- Consider what relationships inside and outside your organization could help you with future incidents.\n- Collaborate with legal teams if a legal action is required.","status":"Waiting","flag":false,"order":9,"extraData":{}},{"_id":"~2457612432","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082944762,"title":"Information gathering","group":"Preparation","description":"- Create a list of all legitimate domains belonging to your company. This will help analysing the situation, and prevent you from starting a takedown procedure on a “forgotten” legitimate website.\n- Prepare one web page hosted on your infrastructure, ready to be published anytime, to warn your customers about a large ongoing fraudulent scam attack. Prepare and test a clear deployment procedure as well.\n- Prepare takedown e-mail forms. You will use them for every fraudulent scam case, if possible in several languages. This will speed up things when trying to reach Internet operating companies during the takedown process.\n- Have several ways to be reached in a timely manner (24/7 if possible):\n  - E-Mail address, easy to remember for everyone (ex: security@yourcompany)\n  - Web forms on your company’s website (location of the form is important, no more than 2 clicks away from the main page)\n  - Visible Twitter account","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~2457616528","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082944781,"title":"Raise customer awareness","group":"Preparation","description":"Don’t wait for scam incidents to communicate with your customers. Raise awareness on several kinds of scamming fraud (lottery scam, 419 scam etc.), explain what it is and make sure your customers know you won’t ever contact them for such matters by e-mail.","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~2457620624","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082945486,"title":"Collect evidence","group":"Identification","description":"Get samples of the fraudulent e-mails sent by the fraudsters. Be careful to collect the e-mail headers in addition to the e-mail content. Collect several e-mails if possible, to check for the real sender’s IP address. This will help the investigation, analyzing if the campaign is sent from one machine or from a botnet.\n\nIf you feel unsafe about collecting e-mail headers, please check http://spamcop.net/fom-serve/cache/19.html","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~2539536384","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082944774,"title":"Contacts","group":"Preparation","description":"- Maintain a list of all people accredited to take decisions on cybercrime and eventual actions regarding the topic. If possible, establish a contract with clear processes.\n-  Establish and maintain a list of takedown contacts in: Hosting companies, Registrars, Registry companies, E-Mail providers\n- Establish and maintain contacts in CERTs worldwide, they will probably always be able to help if involved.","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~2539540480","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082944788,"title":"Fraudulent scam detection","group":"Identification","description":"- Monitor all your points of contact closely (e-mail, web forms, etc.)\n- Deploy spam traps and try to gather spam from partners/third-parties.\n- Deploy active monitoring of scam repositories, like 419scam or Millersmiles for example.\n- Monitor any specialised mailing-list you can have access to, or any RSS/Twitter feed, which could be reporting scam letters.\n\nUse automated monitoring systems on all of these sources, so that every detection triggers an alarm for instant reaction.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3235852512","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082945523,"title":"Assess the end of the case","group":"Recovery","description":"Objective: Come back to the previous functional state.\n\n- Ensure that the fraudulent e-mail address has been shut down\n- If there is any fraudulent website associated to the fraud, keep monitoring it.\n- At the end of a fraudulent scam campaign, remove the associated warning page from your website.","status":"Waiting","flag":false,"order":8,"extraData":{}},{"_id":"~3317764272","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082945483,"title":"Involve appropriate parties","group":"Identification","description":"As soon as a scam campaign is detected, contact the people in your company who are accredited to take a decision, if not you.\n\nThe decision to act on the fraudulent e-mail address must be taken as soon as possible, within minutes.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3317768368","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082945499,"title":"Mitigate the attack’s effects","group":"Containment","description":"- Spread the fraudulent e-mail content on spam/fraud reporting websites/partners/tools.\n- Communicate with your customers.\n\nDeploy the alert/warning page with information about the current\nscam attack if the brand is impacted.\n\nIn case you are impacted several times a week, don’t always deploy an alert/warning message but rather a very informative page about scam, to raise awareness.","status":"Waiting","flag":false,"order":6,"extraData":{}},{"_id":"~3604492424","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652082945506,"title":"Actions to stop the fraud","group":"Remediation","description":"- In case there is a fraudulent web page related to the fraud, hosted on a compromised website, try to contact the owner of the website. Explain clearly the fraud to the owner, so that he takes appropriate actions: remove the fraudulent content, and most of all upgrade the security on it, so that the fraudster cannot come back using the same vulnerability.\n- In any case, also contact the hosting company of the website. Send e-mails to the contact addresses of the hosting company (generally there is an abuse@hostingcompany) then try to get someone on the phone, to speed things up.\n- Contact the e-mail hosting company to shut down the fraudulent account of the fraudster. Don’t forget to send them a copy of the fraudulent e-mail.\n\nIn case you get no answer, or no action is taken, call back and send e-mails on a regular basis.\n\nIf the takedown is too slow, contact a local CERT in the involved country, which could help taking down the fraud, and explain them the difficulties you face.","status":"Waiting","flag":false,"order":7,"extraData":{}}]}