{"_id":"~3194933248","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670343786211,"_updatedAt":1670344265282,"name":"IRM-12-InsiderAbuse","displayName":"Insider Abuse (CERT-SG IRM 12)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":3,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~3031081000","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344250737,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\nIf the incident has not yet been made public, make sure to notify all the impacted stakeholders (customers, concerned partners …) and required authorities. This communication must be made by top management in case of huge impacts.\nEventually warn your employees or local teams about the issue to raise awareness and harden security controls.\n\n**Roll back on the fraudulent operations committed by the insider.**","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3686477992","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344250727,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n**Contacts**\n▪ Make sure to have contact points in your public relation team, human resources team and legal department\n▪ Centralize logging for access controls\n▪ Make sure to have a global authorization and clearance process. This process must specially take care of the removal of privileges on former jobs\n▪ Provide strong authentication accordingly to the risk of the business application\n▪ Prepare internal and external communication strategy\n▪ Prepare a Data Loss Prevention (DLP) process with GDPR and risk team\n\n> Be prepared to notify implicated providers and law enforcement services and regulators if required during an incident(cell crisis management).","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~4259872904","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344250735,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO REMOVE THE THREAT AND AVOID FUTURE INCIDENTS.\n\nThe remediation part is limited in case of an insider abuse. Following actions can be considered depending on the case:\n▪ Take disciplinary action against the malicious employee (or terminate the contract) and remove all his/her credentials\n▪ Review all programs or scripts made by the insider and remove all unnecessary codes\n▪ Review administration tasks (IT Team)\n\n**Involve implicated providers and law enforcement services and regulators if required.**","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~4464697400","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344250731,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n**Technical identification**\n▪ Alerts from a SIEM or correlation tools:\n  o Malicious behavior can have been detected with the correlation of several abnormal events.\n▪ Alerts from an IDS/IPS detecting an intrusion:\n  o In case the insider tried to hack the system, an Intrusion Detection System (or Intrusion Prevention System) can be able to trigger an alert.\n▪ Alerts from DLP controls and services:\n  o Tools and processes to detect and prevent data breaches and data exfiltration.\n▪ Alerts from physical access controls\n\n---\n**Human identification**\n▪ Management:\n  o The manager of the insider might be the first to notice the suspected behavior.\n▪ Control, risk, compliance:\n  o These teams have their own systems to detect operational anomalies and they can also trigger alerts if something abnormal is detected.\n▪ Colleagues:\n  o Insider’s colleagues are maybe the most valuable notification channel because they know perfectly the tasks, the process and the impacts on their duty jobs. They can guess easily what is happening.\n▪ External parties:\n  o External partners or structure can also have their own detection capabilities. If operations have\nbeen falsified internally, these external entities can bring a real enlightenment.","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~4464701496","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344250733,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n\n> Don’t do anything without a written request from the concerned CISO/DPO/person in charge. Based on your legal team advisory, a written permission from the concerned user might also be handy.\n\n**1. Involve people**\nExperts should be informed about the incident so that they can help to assist on it. This includes HR management, legal management, DLP team, PR management and business management of the suspected insider.\n**2. Meeting**\nAn HR manager should meet the suspected insider to explain him/her what has been found and what will happen. Support can be required from legal, technical and management people.\n**3. Privileges lowering**\nIf the suspected insider is allowed to stay at work until the end of the investigation, provide him/her a computer with minimum authorizations.\n**4. Authorization freeze**\nSuspend access and authorizations of the suspected insider. This must include application clearance. This can also include system account, keys, building facility badge.\n**5. Remote access**\nSuspend remote access capabilities, i.e.: smartphones, VPN accounts, tokens...\n**6. Seizure**\nSeize all the professional computing device of the suspected insider\n\n---\n\n**Case 1: abnormal activity**\nIf nothing malicious or fraudulent is confirmed yet, two investigations should start right now:\n▪ forensics investigation on the computing devices of the suspected insider\n▪ log investigation on different audit trails components\n\nUse the IRM 02 or 03 depending on the operating system.\n\n---\n**Case 2: malicious / fraudulent activity**\nIf malicious or fraudulent behavior is already confirmed, think about file a complaint against the suspected insider.\nIn this case, do not take any further technical actions. Provide the legal team or law enforcement officer all requested evidence and be ready to assist on demand.\nIf collateral damages can result from the abuse, be sure to contain the incident impacts before making it public. Be sure to inform authorities if required.\nPrepare a communication plan with the communication team (customers, partners …)","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~4464705592","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344250739,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n**Report**\nAn incident report should be written and made available to all applicable actors.\nThe following themes should be described:\n▪ Initial cause of the infection\n▪ Actions and timelines of every important event\n▪ What went right\n▪ What went wrong\n▪ Incident cost\n▪ Indicators of compromise\n\n---\n**Capitalize**\nSome improvement might be especially valuable considering insider abuse:\n▪ Authorization process improvements\n▪ Controls improvements in the organization\n▪ Awareness on fraud and malicious activity","status":"Waiting","flag":false,"order":5,"extraData":{}}]}