{"_id":"~4341801112","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670344362124,"_updatedAt":1670344960186,"name":"IRM-13-CustomerPhishing","displayName":"Customer Phishing (CERT-SG IRM13)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":2,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~3031085096","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344960181,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n**Phishing Detection**\n▪ Monitor all your points of contact closely (e-mail, web forms, etc.).\n▪ Deploy spam traps and try to gather spam from partners/third-parties.\n▪ Deploy active monitoring of phishing repositories, like PhishTank and Google Safe Browsing for example.\n▪ Monitor any specialized mailing-list you can have access to, or any RSS/Twitter feed, which could be reporting phishing cases.\n▪ Use automated monitoring systems on all of these sources, so that every detection triggers an alarm for instant reaction.\n▪ Monitor your web logs. Check there is no suspicious referrer bringing people to your website. This is often the case when the phishing websites brings the user to the legitimate website after he’s been cheated.\n\n---\n**Involve appropriate parties**\nAs soon as a phishing website is detected, contact the people in your company who are accredited to take a decision, if not you. The decision to act on the fraudulent website/e-mail address must be taken as soon as possible, within minutes.\n\n---\n**Collect evidence**\nMake a time-stamped copy of the phishing web pages. Use an efficient tool to do that, like HTTrack for example. Don’t forget to take every page of the phishing scheme, not just the first one if there are several. If needed, take screenshots of the pages.\nCheck the source-code of the phishing website:\n▪ See where the data is exported: either to another web content you cannot access (a PHP script usually), sent by e-mail to the fraudster or using an application API (like Telegram for example).\n▪ Gather information about the phishing-actor which may be available in URI, source code and credential dropping system (email addresses, Telegram bots, etc).\n▪ Do the graphics come from one of your legitimate websites, or are they stored locally?\n\n\n> If possible, in case the graphics are taken from one of your own websites, you could change the graphics to display a “PHISHING WEBSITE” logo on the fraudster’s page.","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~3031089192","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344960183,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO STOP THE PHISHING CAMPAIGN.\n\n▪ In case the fraudulent phishing pages are hosted on a compromised website, **try to contact the owner of the website**. Explain clearly the fraud to the owner, so that he takes appropriate actions:\nremove the fraudulent content, and most of all upgrade the security on it, so that the fraudster cannot come back using the same vulnerability.\n▪ In any case, also **contact the hosting company of the website**. Send e-mails to the contact addresses of the hosting company (generally there is an abuse@hostingcompany) then try to get someone on the phone, to speed things up.\n▪ **Contact the e-mail hosting company** to shut down the fraudulent accounts which receive the stolen credentials or credit card information (Either on an “e-mail only” phishing case or on a usual one, if you managed to get the destination e-mail address).\n▪ In case there is a redirection (the link contained in the e-mail often goes to a redirecting URL) also **take down the redirection** by contacting the company responsible for the service.\n▪ In case you get no answer, or no action is taken, don’t hesitate to **call back and send e-mails on a regular basis.**\n▪ If the takedown is too slow, **contact a local CERT in the involved country**, which could help taking down the fraud.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3686424624","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344960185,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\n**Assess the end of the phishing case**\n▪ Ensure that the fraudulent pages and/or e-mail address are down.\n▪ Keep monitoring the fraudulent URL. Sometimes a phishing website can reappear some hours later. In case a redirection is used and not taken down, monitor it very closely.\n▪ At the end of a phishing campaign, remove the associated warning page from your website.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3768373272","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344960182,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n\n**Spread the URL of the attack in case of a phishing website:**\nUse every way you have to spread the fraudulent URL on every web browser: use the options of Internet Explorer, Chrome, Safari, Firefox, Netcraft toolbar, Phishing-Initiative, etc.\nThis will prevent the users from accessing the website while you work on the remediation phase.\n\n---\n**Spread the fraudulent e-mail content on spam-reporting websites/partners.**\n\n---\n**Communicate with your customers:**\nDeploy the alert/warning page with information about the current phishing attack.\n\n> In case you are impacted several times a week, don’t always deploy an alert/warning message but rather a very informative phishing page to raise awareness.","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~3768377368","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344960186,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n**Report**\nA crisis report should be written and made available to all of the actors of the crisis management cell.\nThe following themes should be described:\n▪ Initial cause of the infection\n▪ Actions and timelines of every important event\n▪ What went right\n▪ What went wrong\n▪ Incident cost\n\n---\n**Capitalize**\n▪ Consider what preparation steps you could have taken to respond to the incident faster or more efficiently.\n▪ Update your contacts-lists and add notes as to what is the most effective way to contact each involved party.\n▪ Consider what relationships inside and outside your organization could help you with future incidents.\n▪ Collaborate with legal teams if a legal action is required.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~4341805208","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670344960178,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n▪ Create a list of all legitimate domains belonging to your company. This will help analyzing the situation and prevent you from starting a takedown procedure on a forgotten legitimate website.\n▪ Prepare one web page hosted on your infrastructure, ready to be published anytime, to warn your customers about an ongoing phishing attack. Prepare and test a clear deployment procedure as well.\n▪ Prepare takedown e-mail forms. You will use them for every phishing case, if possible, in several languages. This will speed up things when trying to reach the hosting company etc. during the takedown process.\n▪ Deploy DKIM, DMARC and SPF to all mail chain.\n▪ Monitor cybersquatted domains and content posted on them. Gather contact and abuse information to be prepared in the case you need to use them.\n\n---\n**Internal contacts**\n▪ Maintain a list of all people involved in domain names registration in the company.\n▪ Maintain a list of all people accredited to take decisions on cybercrime and eventual actions regarding phishing. If possible, have a contract mentioning you can take decisions.\n\n---\n**External contacts**\n▪ Have several ways to be reached in a timely manner (24/7 if possible):\n  o E-Mail address, easy to remember for everyone (ex: security@yourcompany)\n  o Web forms on your company’s website (location of the form is important, no more than 2 clicks away from the main page)\n  o Visible Twitter account\n▪ Establish and maintain a list of takedown contacts in:\n  o Hosting companies\n  o Registry companies\n  o E-Mail providers\n▪ Establish and maintain contacts in CERTs worldwide, they will probably always be able to help if needed.\n\n---\n**Raise customer awareness**\nDon’t wait for phishing incidents to communicate with your customers. Raise awareness about phishing fraud, explain what phishing is and make sure your customers know you won’t ever ask them for credentials/banking information by e-mail or on the phone.\n\n---\n**Raise business line awareness**\nPeople in business lines must be aware of phishing problems and consider security as a priority.\nTherefore, they should apply good practices such as avoid sending links (URL) to customers and use a signature stating that the company will never ask them for credential/banking information online.","status":"Waiting","flag":false,"order":0,"extraData":{}}]}