{"_id":"~2990125304","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670433185007,"_updatedAt":1670510152686,"name":"IRM-16-Phishing","displayName":"Phishing (CERT-SG IRM16)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":1,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~3276927176","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670510152680,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\n**Assess the end of the phishing case**\n▪ Ensure that the fraudulent pages and/or e-mail address are down.\n▪ Keep monitoring the fraudulent URL. Sometimes a phishing website can reappear some hours later. In case a redirection is used and not taken down, monitor it very closely.\n\n> At the end of a phishing campaign, remove the associated warning page from your website.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3481731192","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670510152677,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO STOP THE PHISHING CAMPAIGN.\n\n▪ Change and/or block temporarily login credentials of compromised accounts.\n\n> If the phishing campaign was targeted, consider contacting law enforcement andregulators.\n> You may consider contacting your local CERT.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3727511720","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670510152674,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n\n▪ Block network IOCs discovered via the attachment / URL analysis on DNS, firewalls, or proxies.\n▪ Block the phishing campaign based on senders, subjects, or other email artifacts via email gateway.\n▪ Try to delete phishing emails from inbox.\n▪ Apply DNS Sinkhole on the suspicious URL (optional depending on DNS architecture).\n▪ Communicate with your collaborators.\n▪ Deploy the alert/warning page with information about the current phishing attack.","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~3932258520","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670510152670,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n**Phishing Detection**\n\n▪ Monitor all your points of contact closely (e-mail, web forms, etc.)\n▪ Deploy spam traps and try to gather spam from partners/third parties.\n▪ Deploy active monitoring of phishing repositories, like PhishTank and Google Safe Browsing for example.\n▪ Monitor any specialized mailing-list you can have access to, or any RSS/Twitter feed, which could be reporting phishing cases.\n▪ Use automated monitoring systems on all these sources, so that every detection triggers an alarm for instant reaction.\n▪ Monitor your web logs. Check there is no suspicious referrer bringing people to your website. This is often the case when the phishing websites brings the user to the legitimate website after he’s been cheated.\n\n**Phishing attack scoping**\n▪ Determine the number of targeted users.\n▪ Search for exploited compromised accounts and identify related malicious activities.\n\n**Analyze the phishing**\nRemember to follow established analysis procedures\n▪ Determine:\n  o If it is a credential harvesting campaign or a malware spreading campaign\n  o If it is a targeted campaign or not\n▪ Inspect message subject and body.\n▪ Use sandbox environment to analyse malicious attachments and extract IOCs.\n▪ Analyse links, domain and hostnames with threat intelligence services.\n▪ Check the source-code of the phishing website.\n▪ Investigate email headers for interesting artifacts: originated server and sender information for example.\n\n**Collect evidence**\nMake a time-stamped copy of the phishing web pages. Use an efficient tool to do that, like HTTrack for example. Don’t forget to take every page of the phishing scheme, not just the first one if there are several. If needed, take screenshots of the pages.","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~3932262616","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670510152682,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n**Report**\nA crisis report should be written and made available to all of the actors of the crisis management cell.\n\nThe following themes should be described:\n▪ Initial cause of the infection\n▪ Actions and timelines of every important event\n▪ What went right\n▪ What went wrong\n▪ Incident cost\n▪ Indicators of compromise\n\n---\n**Capitalize**\n▪ Consider what preparation steps you could have taken to respond to the incident faster or more efficiently.\n▪ Update your contacts-lists and add notes as to what is the most effective way to contact each involved party.\n▪ Consider what relationships inside and outside your organization could help you with future incidents.\n▪ Collaborate with legal teams if a legal action is required.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~4792483928","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670510152667,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n▪ Prepare a communication, ready to be published anytime, to warn your collaborators about an ongoing phishing attack. Prepare and test a clear deployment procedure as well.\n▪ Deploy DKIM, DMARC and SPF to all mail chain.\n▪ Implement multi-factor authentication mechanisms.\n▪ Monitor cybersquatted domains and content posted on them. Gather contact and abuse information to be prepared in the case you need to use them.\n\n---\n**Internal contacts**\n▪ Maintain a list of all people involved in domain names registration in the company.\n▪ Maintain a list of all people accredited to take decisions on cybercrime and eventual actions regarding phishing. If possible, have a contract mentioning you can take decisions.\n\n---\n**External contacts**\n▪ Have several ways to be reached in a timely manner (24/7 if possible):\n  o E-Mail address, easy to remember for everyone (ex: security@yourcompany)\n  o Web forms on your company’s website (location of the form is important, no more than 2 clicks away from the main page)\n  o Visible Twitter account\n▪ Establish and maintain a list of takedown contacts in:\n  o Hosting companies\n  o Registry companies\n  o E-Mail providers\n▪ Establish and maintain contacts in CERTs worldwide, they will probably always be able to help if needed.\n\n---\n**Raise customer awareness**\nDon’t wait for phishing incidents to communicate with your customers. Raise awareness about phishing fraud, explain what phishing is and make sure your customers know you won’t ever ask them for credentials/banking information by e-mail or on the phone.\n\n---\n**Raise business line awareness**\nPeople in business lines must be aware of phishing problems and consider security as a priority. Therefore, they should apply good practices such as avoid sending links (URL) to customers and use a signature stating that the company will never ask them for credential/banking information online.\n▪ Run periodic awareness phishing campaigns.\n▪ Deploy a technical solution allowing collaborators to easily report email to security teams.\n▪ Establish specific procedures for attachment and URL analysis.","status":"Waiting","flag":false,"order":0,"extraData":{}}]}