{"_id":"~3031044136","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670336022246,"_updatedAt":1670336513201,"name":"IRM-6-WebsiteDefacement","displayName":"Website Defacement (CERT-SG IRM6)","titlePrefix":"","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":3,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~3686404144","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670336512510,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO REMOVE THE THREAT AND AVOID FUTURE DEFACEMENTS.\n\n▪ Remove all altered content and replace it with legitimate content, restored from earlier backup.\n▪ Make sure this content is free from vulnerabilities; patch if necessary.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3686408360","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670336511837,"title":"Containment","group":"default","description":"## OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n\n▪ Back up all the data stored on the web server for forensic purposes and evidence collection. The best practice here, if applicable, is to create a complete bit-to-bit copy of the hard-disk used by the web server. This may notably be helpful to recover deleted content.\n▪ Check your network architecture map. Verify that the vulnerability exploited by the attacker is not located elsewhere:\n  o Check the system on which the web server is running\n  o Check other services running on that machine\n  o Check incoming and outgoing connections made from the server\n\n---\n**If the source of the attack stems from another system, investigate the culprit machine.**\n▪ Try to find evidence behind every action perpetrated by the attacker:\n▪ Find out how the attacker got into the system in the first place and fix the root cases:\n  o A web component vulnerability allowing write access: fix the vulnerability by applying applicable remediations\n  o CMS plugin vulnerabilities are often exploited by attackers and need to be identified and patched;\n  o Open public folder: make it private\n  o SQL weakness allowing injection: correct the code\n  o Mashup components: cut off implicated mashup feeds\n  o An administrative modification by physical access: modify the access rights\n\n> If required (complex issue on an important web server), deploy a temporary up-to-date web server. The server should offer the same content than that one of the compromised machine or at least display legitimate content such as a static maintenance page. The best is to display temporary static content, containing only HTML code. This prevents another infection in case the attacker is still able to leverage the same vulnerability.","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~4259844232","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670336513187,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\n▪ Change all user passwords if the web server provides user-authentication and you have evidence or reasons to believe the passwords may have been compromised. This may require a user communication campaign.\n▪ If a backup server has been used, restore the primary web server components to the nominal state.\n▪ Monitor logs and alerts closely to detect new attacks.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~4341764248","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670336511119,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT\n\n▪ Have up-to-date schemes describing your applicative components related to the web server.\n▪ Make sure you have an up-to-date network map.\n▪ Build a backup website up-and-ready, on which you can publish content.\n▪ Define a procedure to redirect every visitor to this backup website (a static maintenance page for example).\n▪ Deploy monitoring and intrusion prevention tools (WAF, fail2ban and the likes) to detect and prevent any abnormal activities targeting your critical webservers.\n▪ Export the web server’s log files to an external server. Make sure clocks are synchronized between each server.\n▪ Deploy attack and vulnerability exploitation detection rules based on the server’s logs and monitor them.\n▪ Audit your websites before the release and on regular basis (monthly if possible).\n▪ Reference all sources of external static or dynamic contents.\n▪ Have operational contacts of your hosting provider readily available.\n▪ Make sure your hosting provider enforces policies to log all events and verify your contractual compliance.\n▪ Prepare communication templates in case the incident is visible for users and needs to be explained.","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~4341768344","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670336513195,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n**Communication**\nIf the defacement has become public, consider preparing and sending out a dedicated communication message explaining the incident.\n\n---\n**Report**\nA crisis report should be written and made available to all of the involved parties.\n\nThe following topics should be detailed:\n▪ Initial detection\n▪ Actions and timelines\n▪ What went right\n▪ What went wrong\n▪ Incident’s cost\n▪ Indicators of compromise\n\n\nShould a vulnerability be identified, report any undocumented flaw impacting to the application’s editor,\nso that the code can be reviewed and receive an official fix.\n\n---\n**Capitalize**\nActions to improve the handling of defacement incidents should be defined to capitalize on this\nexperience.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~4464644152","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670336511832,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n**Usual channels of detection are:**\n\n▪ Webpage monitoring: The content of a web page has been altered. The new content is either very discreet (an “iframe” injection for example) or explicit (“You have been hacked by xxx”).\n▪ Users: you receive calls from users or notifications from employees about problems they notice while browsing the website.\n▪ Security checks with tools such as Google SafeBrowsing. \n\n---\n**Verify the defacement incident and detect its origin:**\n▪ Check files’ metadata (in particular, check modification dates, hash signatures).\n▪ Check mashup content providers.\n▪ Check links present in the source code (src, meta, css, scripts, …).\n▪ Check log files and alerts generated by the detection rules.\n▪ Scan databases for malicious content.\n\n> The source code of the suspicious page must be analyzed carefully to identify and scopeup the problem.\n> Be sure the problem originates from a web server belonging to the company and not from the web content located outside your infrastructure, such as in ad banners from a third party.","status":"Waiting","flag":false,"order":1,"extraData":{}}]}