{"_id":"~4792496216","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1670520403294,"_updatedAt":1670520403323,"name":"IRM-18-LargeScaleCompromise","displayName":"Large Scale Compromise (CERT-SG IRM18)","description":"This Incident Response Methodology is a cheat sheet dedicated to handlers investigating on a precise security issue.\n\n**WHO SHOULD USE IRM SHEETS?**\n\n- Administrators\n- Security Operation Center\n- CISOs and deputies\n- CERTs (Computer Emergency Response Team)\n\n**Remember: If you face an incident, follow IRM, take notes. Keep calm and contact your business line’s Incident Response team or CERT immediately if needed.**\n\nReferences:\n→ IRM CERT SG: https://github.com/certsocietegenerale/IRM","severity":4,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~3276931272","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520403295,"title":"Preparation","group":"default","description":"## OBJECTIVE: ESTABLISH CONTACTS, DEFINE PROCEDURES, GATHER INFORMATION TO SAVE TIME DURING AN INCIDENT.\n\n▪ Deploy an EDR solution on endpoints and servers:\n  o This tool became one of the cornerstones of the incident response in case of ransomware or in large scale compromise, facilitating identification, containment, and remediation phases\n  o Launch EDR Search and AV scan with IOC explicit rules and get first indicators for remediation progress following\n  o Set your EDR policies in prevent mode\n▪ Block IOCs linked to malware activities gathered by Threat Intelligence.\n▪ Deploy and operate security solutions enabling detection and facilitating response:\n  o Log gathering in a SIEM\n  o Have the capacity to run tools like YARA or DFIR-ORC (ANSSI) (https://github.com/dfir-orc)\n▪ Have a good log retention and verbosity.\n▪ Define a strict posture versus the attacker.\n▪ Prepare internal and external communication strategy.\n▪ Have a process to define a posture as soon as the compromise is detected: discreet or fast reaction.\n\n> Be prepared to notify abuse teams and law enforcement services and regulators if required during an incident (cell crisis management).\n\n---\n**Endpoint**\n▪ A good knowledge of the usual operating systems security policies is needed.\n▪ A good knowledge of the usual users’ profile policies is needed.\n▪ Ensure that the monitoring tools are up to date.\n▪ Establish contacts with your network and security operation teams.\n▪ Make sure that an alert notification process is defined and well-known from everyone.\n▪ Make sure all equipment get setting on same NTP.\n▪ Select what kind of files can be lost / stolen and restrict the access for confidential files.\n▪ Make sure that analysis tools are up, functional (Antivirus, EDR, IDS, logs analyzers), not compromised, and up to date.\n\n---\n**Network**\n▪ A good knowledge of architecture, VLAN segmentation and interconnexions:\n  o Have the capability to isolate entities, regions, partners, or Internet.\n▪ Make sure that an inventory of the network access points is available and up to date.\n▪ Make sure that network teams have up to date network maps and configurations.\n▪ Look for potential unwanted network access points (xDSL, Wi-Fi, Modem, …) regularly and close them.\n▪ Ensure that traffic management tools and processes are operational.\n▪ A good knowledge of the usual network activity of the machine/server is needed. You should have a file on a secure place describing the usual port activity, to compare efficiently to the current state.\n\n---\n**Baseline traffic**\n▪ Identify the baseline traffic and flows; Identify the business-critical flows.","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~3604598888","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520403301,"title":"Containment","group":"default","description":"OBJECTIVE: MITIGATE THE ATTACK’S EFFECTS ON THE TARGETED ENVIRONMENT.\n**1 - If the issue is considered as strategic (sensitive resources access), a specific crisis management cell should be activated:**\n▪ Make sure that all footholds of the attackers have been identified before taking containment measure\n▪ Be discrete if necessary and possible\n\n---\n**2 - If applicable to the attack:**\n▪ Isolate compromised VLAN, interconnexion, entities, regions, partners, or Internet\n▪ Disconnect all computers that have been detected as compromised from the network\nYou could isolate with your EDR and shut down internet just keeping your EDR connections up.\n▪ Block traffic to C2s\n▪ Block any IP detected as used by attackers\n▪ Disable accounts compromised/created by attackers\n▪ Send the undetected samples to your endpoint security provider and/or private sandboxes\n▪ Send the uncategorized malicious URL, domain names and IP to your perimetric security provider\n\n---\n**3 - If business-critical traffic cannot be disconnected, allow it after ensuring that it cannot be an infection vector or find validated circumventions techniques.**\n\n---\n**4 - Neutralize the propagation vectors. A propagation vector can be anything from network traffic to software flaw. Relevant countermeasures have to be applied (patch, traffic blocking, disable devices, etc.:**\nFor example, the following techniques can be used:\n▪ Patch deployment tools (WSUS)\n▪ Windows GPO\n▪ Firewall rules\n▪ DNS sinkhole\n▪ Stop Sharefile services\n▪ Terminate unwanted connections or processes on affected machines\n\n---\n**5 - Repeat steps 2 to 4 on each sub-area of the infected area until the worm stops spreading. If possible, monitor the infection using analysis tools (antivirus/EDR console, server logs, support calls):\nApply ad hoc actions in case of strategic issue:**\n▪ Block exfiltration destination or remote location on Internet filters\n▪ Restrict strategic file servers to reject connections from the compromised computer\n▪ Notify targeted business users about what must be done and what is forbidden\n▪ Configure logging capabilities in verbose mode on targeted environment and store them in a remote\nsecure server","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~3604602984","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520403306,"title":"Recovery","group":"default","description":"## OBJECTIVE: RESTORE THE SYSTEM TO NORMAL OPERATIONS.\n\nPrioritize your recovery plan based on your DRP (disaster recovery plan).\n\nAll the following steps shall be made in a step-by-step manner and with technical monitoring.\n\n---\n**Endpoint**\nEnsure that no malicious binaries are present on the systems before reconnecting them\n▪ Best practice is to reinstall compromised system fully from original media\n▪ Apply all fixes to the newly installed system\n▪ If this solution is not applicable:\n  o Restore any altered files\n  o Change all passwords (with a strong password policy)\n---\n**Network**\n1. Ensure that the network traffic is back to normal (secured)\n2. Re-allow the network traffic that was used as a propagation method by the attacker\n3. Reconnect sub-areas together if necessary\n4. Reconnect the area to your local network if necessary\n5. Reconnect the area to the Internet if necessary\n\n**Monitor network traffic to identify if any infection remains.\nIf possible, apply geo-filtering on firewalls to block illegitimate foreign country traffic.**","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~3727536296","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520403304,"title":"Remediation","group":"default","description":"## OBJECTIVE: TAKE ACTIONS TO REMOVE THE THREAT AND AVOID FUTURE INCIDENTS.\n\n**Endpoint**\n▪ Reinitialize all accesses to the accounts involved in the incident\n▪ Remove any accounts created by attackers\n▪ Remove the initial access used by the attacker\n▪ Remove binaries used by the attacker to lateralize on the network\n▪ Remove persistence\n▪ Change password of compromised accounts\n▪ Go back configuration changes\n▪ Operate a system hardening\n\n---\n**Network**\n▪ Find out all communication channels used by the attacker and block them on all your network boundaries\n▪ If the source has been identified as an insider, take appropriate actions, and involve your management and/or HR team and/or legal team\n▪ Check if security configuration is untouched: GPO, AV, EDR, Patch…\n▪ Operate network configuration hardening\n\n> If the source has been identified as an external offender, consider involving abuse teams and law enforcement services and regulators if required.\n\n*Remediation steps from IRM-2 and IRM-3 can also be useful.*","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3932274904","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520403320,"title":"Lessons learned","group":"default","description":"## OBJECTIVE: DOCUMENT THE INCIDENT’S DETAILS, DISCUSS LESSONS LEARNED, AND ADJUST PLANS AND DEFENSES.\n\n**Report**\nAn incident report should be written and made available to all the stakeholders.\nThe following themes should be described:\n▪ Initial cause of the infection\n▪ Actions and timelines of every important event\n▪ What went right\n▪ What went wrong\n▪ Incident cost\n▪ Indicators of compromise\n\n---\n**Capitalize**\nActions to improve malware and network intrusion detection processes should be defined to capitalize on this experience, especially awareness.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~4792500312","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1670520403296,"title":"Identification","group":"default","description":"## OBJECTIVE: DETECT THE INCIDENT, DETERMINE ITS SCOPE, AND INVOLVE THE APPROPRIATE PARTIES.\n\n> You may need to notify abuse teams and law enforcement services and regulators at the beginning of this step if required.\n\n---\n**Detection**\n▪ Monitoring of IOCs \"from Threat intelligence\" by SOC.\n▪ Supervision of Antivirus, EDR, SIEM, IDS alerts and logs.\n▪ Odd professional emails (often masquerading as invoices) containing attachments are being received.\n▪ Lateral movement is usually done, check all connection to the AD and ShareFile server with privileged accounts at abnormal day time.\n▪ High number of accounts locked.\n▪ Look for unusual network or web browsing activities; especially connections to Tor I2P IP, Tor gateways (tor2web, etc) or Bitcoin payment websites.\n▪ Look for rare connections.\n\n> If a machine is identified with a malware, unplug it from network and keep it turned on for memory forensics investigation .\n\n---\n**Scoping of the incident**\n▪ Use EDR, endpoint logs, system logs, tools allowing at scale IOC search.\n▪ Identify pivoting techniques on the network.\n▪ Review statistics and logs of network devices.\n▪ Identify malicious usage of compromised accounts.\n▪ Identify Command and control servers in firewall logs, proxy logs, IDS logs, system logs, EDR, DNS logs, NetFlow and router logs.\n\n---\n**Find initial vector of compromise**\n▪ Investigate exposed assets (especially those who are not up to date).\n▪ Verify the presence of binaries in user profiles, `%ALLUSERSPROFILE%` or `%APPDATA%` and `%SystemDrive%`.\n\n> **The identification of the Threat Actor at the origin of the attack could help the following phases based on known TTPs**\n> \n> At the end of this step, the impacted machines and the modus operandi of the attack should have been identified. Ideally, the source of the attack should have been identified as well. This is where you should do your forensic investigations. Keep your backup safe and disconnected from compromised scope.","status":"Waiting","flag":false,"order":1,"extraData":{}}]}