{"_id":"~1966096616","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1652084075840,"_updatedAt":1652084452250,"name":"Insider Abuse","displayName":"Insider Abuse (CERT-SG IRM12)","titlePrefix":"","description":"Insider Abuse","severity":3,"tags":[],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~1966108904","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452238,"title":"Restore the system to normal operations","group":"Recovery","description":"If the incident has not been made public yet, be sure to warn all the impacted stakeholders (customers, concerned partners ...) and required authorities. This communication must be made by top management in case of huge impacts.\n\n\nEventually warn your employees or some local teams about the issue to raise awareness and increase security rules.","status":"Waiting","flag":false,"order":7,"extraData":{}},{"_id":"~2457637008","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452212,"title":"Contacts","group":"Preparation","description":"- Make sure to also have contact points in your public relation team, human resources team and legal department\n- Have a centralized logging facility\n- Be sure to have a global authorization and clearance process. This process must specially take care of the removal of privileges on former jobs\n- Provide strong authentication accordingly to the risk of the business application","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~2457641104","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452227,"title":"Abnormal activity","group":"Containment","description":"If nothing malicious or fraudulent is confirmed yet, two investigations should start right now:\n- forensics investigation on the computing devices of the suspected insider.\n- log investigation on different audit trails components","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~2457645200","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452235,"title":"Remove the threat and avoid future incidents","group":"Remediation","description":"The remediation part is pretty limited in case of an insider abuse. Following actions can be considered depending on the case:\n- Take disciplinary action against the malicious employee (or terminate the contract) and remove all his/her credentials.\n- Delete all fictitious or fraudulent operations made by the insider\n- Review all programs or scripts made by the insider and remove all unnecessary codes","status":"Waiting","flag":false,"order":6,"extraData":{}},{"_id":"~2990100696","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452231,"title":"Malicious / Fraudulent activity","group":"Containment","description":"If malicious or fraudulent behaviour is already confirmed, think about file a complaint against the suspected insider.\nIn this case, do not take any further technical actions. Provide the legal team or law enforcement officer all requested evidences and be ready to assist on demand.\n\nIf collateral damages can result from the abuse, be sure to contain the incident impacts before making it public. Be sure to inform authorities if required.","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~3194892456","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452222,"title":"Mitigate attacks effects","group":"Containment","description":"Don’t do anything, without a written request from the concerned CISO/person in charge. Based on your legal team advisory, a written permission from the concerned user might also be handy.\n\n- Involve people: Different people should be informed about the abuse so that they can help to assist on it. This includes HR management, legal management, PR management and business management of the suspected insider.\n- Meeting: An HR manager should meet the suspected insider to explain him/her what has been found and what will happen. Support can be required from legal, technical and management people.\n- Privileges lowering: If the suspected insider is allowed to stay at work until the end of the investigation, provide him/her a computer with minimum authorizations.\n- Authorizationfreeze: Suspend access and authorizations of the suspected insider. This must include application clearance. This can also include system account, keys, building facility badge.\n- Remote access: Suspend remote access capabilities, i.e.: smartphones, VPN accounts, tokens...\n- Seizure: Seize all the professional computing device of the suspected insider.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~3194896552","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452246,"title":"Capitalize","group":"Aftermath","description":"Some improvement might be especially valuable considering insider abuse:\n- Authorization process improvements\n- Controls improvements in the organisation \n- Awareness on fraud and malicious activity","status":"Waiting","flag":false,"order":9,"extraData":{}},{"_id":"~3235856608","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452219,"title":"Human identification","group":"Identification","description":"- Management: The manager of the insider might be the first to notice the suspected behaviour.\n- Control, risk, compliance: These teams have their own systems to detect operational anomalies and they can also trigger alerts if something abnormal is detected.\n- Colleagues: Insider’s colleagues are maybe the most valuable notification channel because they know perfectly the tasks, the process and the impacts on their duty jobs. They can guess easily what is happening.\n- External parties: External partners or structure can also have their own detection capabilities. If operations have been falsified internally, these external entities can bring a real enlightenment.","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~3932172376","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452217,"title":"Technical Identification","group":"Identification","description":"- Alerts from a SIEM or correlation tools: Malicious behaviour can have been detected with the correlation of several abnormal events\n- Alerts from an IDS/IPS detecting an intrusion: In case the insider tried to hack the system, an Intrusion Detection System (or Intrusion Prevention System) can be able to trigger an alert.","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~3932176472","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652084452241,"title":"Report","group":"Aftermath","description":"An incident report should be written and made available to all of the actors of the incident.\nThe following themes should be described: \n- Initial detection\n- Actions and timelines\n- What went right\n- What went wrong \n- Incident impact","status":"Waiting","flag":false,"order":8,"extraData":{}}]}