{"_id":"~3604598920","_type":"CaseTemplate","_createdBy":"florian@strangebee.com","_updatedBy":"florian@strangebee.com","_createdAt":1652090146321,"_updatedAt":1652176767828,"name":"Website defacement","displayName":"Website defacement (CERT-SG IRM6)","titlePrefix":"","description":"Website defacement","severity":3,"tags":["veris:attribute:integrity:variety=\"Defacement\"","veris:action:social:vector=\"Website\""],"flag":false,"tlp":2,"pap":2,"customFields":[],"tasks":[{"_id":"~1966207208","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318794,"title":"Verify the defacement and detect its origin:","group":"Identification","description":"- Check files with static content (in particular, check the modification dates, hash signature).\n- Checkmashupcontentproviders.\n- Check link presents in the web page (src, meta, css, script, ...).\n- Checklogfiles.\n- Scan the databases for malicious content.\n\n**The source code of the suspicious page must be analysed carefully to identify the problem clearly.** In particular, **be sure the problem is on a web server belonging to the company** and not on a web content located outside your infrastructure, like commercial banners from a third party.","status":"Waiting","flag":false,"order":1,"extraData":{}},{"_id":"~1966211304","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318796,"title":"Try to find evidences of every action of the attacker","group":"Containment","description":"- Find out how the attacker got into the system in the first place and fix it :\n  - Web component vulnerability allowing write access: fix the vulnerability by applying editor’s fix.\n  - Open public folder: fix the bug.\n  - SQL weakness allowing injection: correct the code.\n  - Mashup components: cut mashup feed.\n  - Administrative modification by physical access: modify the access rights.\n\n- **If required (complex issue and very important web server), deploy a temporary web server**, up to date with its applications. It should offer the same content than the compromised web server or at least show another legitimate content such as “Temporary unavailable”. The best is to display a temporary static content, containing only HTML code. This prevents another infection in case the attacker has used vulnerability in the legitimate PHP/ASP/CGI/PL/etc. code.","status":"Waiting","flag":false,"order":3,"extraData":{}},{"_id":"~2457833616","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318797,"title":"Remove all altered content","group":"Remediation","description":"Remove all altered content and replace it with the legitimate content, restored from earlier backup. Make sure this content is free from vulnerabilities.","status":"Waiting","flag":false,"order":4,"extraData":{}},{"_id":"~2457837712","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318798,"title":"Change all user passwords","group":"Recovery","description":"**Change all user passwords**, if the web server provides user-authentication, and you have evidence/reasons to think the passwords may have been compromised. This can require a large user communication","status":"Waiting","flag":false,"order":5,"extraData":{}},{"_id":"~3194966184","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318799,"title":"Restore primary web server if backup server has been used","group":"Recovery","description":"If backup server has been used, restore the primary web server component as nominal","status":"Waiting","flag":false,"order":6,"extraData":{}},{"_id":"~3235963104","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318793,"title":"Preparation","group":"Preparation","description":"- Have up-to-date schemes describing your applicative components related to the web server.\n- Build a backup website up and ready, on which you can publish content.\n- Define a procedure to redirect every visitor to this backup website.\n- Deploy monitoring tools to quickly detect any abnormal behaviour on your critical websites.\n- Export the web server’s log files to an external server. Make sure clocks are synchronized between each server.\n- Reference external contents (static or dynamic) and create a list for each of them. Don’t forget third parties for advertisement.\n- Reference contact points of your hosting provider.\n- Be sure your hosting provider enforces policies to log all events.\n- Make sure you have an up-to-date network map.","status":"Waiting","flag":false,"order":0,"extraData":{}},{"_id":"~3235967200","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318795,"title":"Mitigate the attack’s effects","group":"Containment","description":"- **Backup all data** stored on the web server for forensic purposes and evidence collecting. The best practice here if applicable is to make a complete bit-by-bit copy of the hard-disk containing the web server. This will be helpful to recover deleted files.\n- **Check your network architecture map. Verify that the vulnerability exploited by the attacker is not located somewhere else** :\n  - Check the system on which the web server is running,\n  - Check other services running on that machine,\n  - Check the connections to other systems, which might be compromised.\n\nIf the source of the attack is another system on the network, disconnect it if possible physically and investigate on it.","status":"Waiting","flag":false,"order":2,"extraData":{}},{"_id":"~3235971296","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318800,"title":"Communication","group":"Aftermath","description":"If the defacement has been visible for part of your users, plan to explain the incident publicly.","status":"Waiting","flag":false,"order":7,"extraData":{}},{"_id":"~3317846192","_type":"Task","_createdBy":"florian@strangebee.com","_createdAt":1652095318800,"title":"Report","group":"Aftermath","description":"A crisis report should be written and made available to all of the involved parties.\n\nThe following themes should be described: \n- Initial detection;\n- Actions and timelines;\n- What went right;\n- What went wrong; \n- Incident cost.\n\nIn case of vulnerability discovery, report any undocumented vulnerability lying on a product running on the web server (like a PHP forum) to its editor, so that the code can be upgraded in order to release a fix.","status":"Waiting","flag":false,"order":8,"extraData":{}}]}